2. Creating Database with K 

CREATE DATABASE class4          
    WITH        
    OWNER = postgres            
    ENCODING = 'UTF8'           
    CONNECTION LIMIT = -1;

3. relationship between at least 5 tables         
                
customer table - address table          
foreign key : address id                                                                                 
address_id is primary key of the address table

film table - film_actor table               
foreign key : film_id                   
film_id is primary key of the film table            

film_actor table- actor table               
fk : actor_id               
actor id is pk of the actor table


film table - language table                 
fk: language_id             
language_id is pk of the language table                 
 
 
city table -country table               
fk : country_id                 
country_id is pk of the country table

5. Creating 3 tables with K

CREATE TABLE language (															
	language_id INTEGER PRIMARY KEY NOT NULL,												
	name varchar(15) NOT NULL,											
	last_update TIMESTAMP NOT NULL											
	);										
	

CREATE TABLE store (				
	store_id INTEGER PRIMARY KEY NOT NULL,					
	manager_staff_id INTEGER NOT NULL,					
	addresss_id INTEGER NOT NULL,		
	last_update TIMESTAMP NOT NULL			
	);              				

CREATE TABLE film_actor(				
	actor_id SERIAL PRIMARY KEY NOT NULL,					
	film_id INTEGER NOT NULL,					
	last_update TIMESTAMP NOT NULL						
    );

6. Creating 3 tables with C

In [2]:
import psycopg2                                                     
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""CREATE TABLE FILM_CATEGORY(
    film_id INTEGER PRIMARY KEY,
    category_id INTEGER,
    last_update TIMESTAMP
);"""
cur.execute(command)
cur.close()
conn.commit()
conn.close()

In [3]:
import psycopg2                                                     
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""CREATE TABLE COUNTRY(
    country_id INTEGER PRIMARY KEY,
    country VARCHAR(25),
    last_update TIMESTAMP
);"""
cur.execute(command)
cur.close()
conn.commit()
conn.close()

In [5]:
import psycopg2                                                     
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""CREATE TABLE INVENTORY(
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    last_update TIMESTAMP
);"""
cur.execute(command)
cur.close()
conn.commit()
conn.close()

8. Entering 5 values to the 3 tables with K

INSERT INTO city (city_id,city,country_id,last_update) VALUES (1,'Adana', 97, '2006-02-15')                     
INSERT INTO city (city_id,city,country_id,last_update) VALUES (2,'Bakü', 48, '2006-02-15')                  
INSERT INTO city (city_id,city,country_id,last_update) VALUES (3,'Balıkesir', 97, '2006-02-15')             
INSERT INTO city (city_id,city,country_id,last_update) VALUES (4,'Denizli', 97, '2006-02-15')               
INSERT INTO city (city_id,city,country_id,last_update) VALUES (5,'Basel', 91, '2006-02-15')             



INSERT INTO actor (actor_id,first_name,last_name,last_update) VALUES (6, 'Bob', 'Fawcett', '2023-02-14 17:20:00')                   
INSERT INTO actor (actor_id,first_name,last_name,last_update) VALUES (7, 'Parker', 'Goldberg','2023-02-14 17:20:00')                    
INSERT INTO actor (actor_id,first_name,last_name,last_update) VALUES (8, 'Natalie', 'Hopkins', '2023-02-14 17:20:00')                   
INSERT INTO actor (actor_id,first_name,last_name,last_update) VALUES (9, 'Julia', 'Barrymore','2023-02-14 17:20:00')                
INSERT INTO actor (actor_id,first_name,last_name,last_update) VALUES (10, 'Cameron', 'Wray', '2023-02-14 17:20:00')             




INSERT INTO category (category_id,name, last_update) VALUES (6, 'Drama', '17.12.1997 07:37:16.00 PST')                  
INSERT INTO category (category_id,name, last_update) VALUES (7, 'Family', '17.12.1997 07:37:16.00 PST')                 
INSERT INTO category (category_id,name, last_update) VALUES (8, 'Documentary', '17.12.1997 07:37:16.00 PST')                    
INSERT INTO category (category_id,name, last_update) VALUES (9, 'Games', '17.12.1997 07:37:16.00 PST')                  
INSERT INTO category (category_id,name, last_update) VALUES (10, 'Foreign', '17.12.1997 07:37:16.00 PST')

9. Entering 5 values to 3 tables with C

In [7]:
import psycopg2
from datetime import date, datetime

conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()

country_list=['Afghanistan','Algeria','Angola','Argentine','Armenia']
datetime_obj=datetime.now()
t=datetime_obj.strftime('%H:%M:%S')



for i in range(5):
   cur.execute('INSERT INTO country VALUES (%s,%s,%s)', (i,country_list[i],datetime_obj))
    
cur.close()
conn.commit()
conn.close()

22:58:34

In [9]:
import psycopg2
from datetime import date, datetime

conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()

language_list=['English','German','French','Japanese','Turkish']
datetime_obj=datetime.now()
t=datetime_obj.strftime('%H:%M:%S')


for i in range(5):
   cur.execute('INSERT INTO language VALUES (%s,%s,%s)', (i,language_list[i],datetime_obj))
    
cur.close()
conn.commit()
conn.close()

23:04:27

In [14]:
import psycopg2

conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()

for i in range(5):
   cur.execute("INSERT INTO inventory VALUES (%s,%s,%s,%s)",(i+1,i+1,i+1,datetime_obj))
cur.close()
conn.commit()
conn.close()

11. Changing 1 value in 3 tables with K

UPDATE actor SET first_name='Ariel' WHERE actor_id='3';                     
UPDATE film_actor SET film_id='3' WHERE actor_id='1';                   
UPDATE city SET city='Baku' WHERE city_id='2';

12. Changing 1 value in 3 tables with C

In [16]:
import psycopg2

conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
cur.execute('UPDATE store SET addresss_id=7 WHERE store_id=4')   #1
cur.execute('UPDATE language SET name=\'Mandarin\' WHERE language_id=3')   #2
cur.execute("UPDATE film_category SET category_id= 12 WHERE film_id=5")    #3

cur.close()
conn.commit()
conn.close()

14. Deleting last value in 3 tables with K

DELETE FROM store WHERE store_id=5 ;                    
DELETE FROM inventory WHERE inventory_id=5 OR film_id=5 ;                   
DELETE FROM actor WHERE actor_id=10;

15. Deleting last value in 3 tables with C

In [18]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
cur.execute('DELETE FROM category WHERE category_id=10')
cur.execute('DELETE FROM film_actor WHERE actor_id=5 ')
cur.execute('DELETE FROM country WHERE country_id=4')

cur.close()
conn.commit()
conn.close()

17. Deleting a table with K

DROP TABLE film_actor

18. Deleting a table with C

In [19]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
cur.execute('DROP TABLE film_category')

cur.close()
conn.commit()
conn.close()

19. Creating a new table from another table's column wih K

CREATE table category_ AS SELECT city_id,city FROM city

20. Creating a new table from another table's column with C

In [22]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""
CREATE TABLE adress_ AS SELECT city_id,city FROM city"""
cur.execute(command)

cur.close()
conn.commit()
conn.close()

22. Making Truncate a table with K

TRUNCATE TABLE adress_;

23. Making Truncate a table with C

In [23]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""TRUNCATE TABLE store;"""
cur.execute(command)

cur.close()
conn.commit()
conn.close()

25. Deleting 2 tables with K

DROP TABLE category;            
DROP TABLE category_;

26. Deleting 2 tables with C

In [25]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""DROP TABLE country;
           DROP TABLE inventory;"""
cur.execute(command)

cur.close()
conn.commit()
conn.close()

28. Deleting last table in the server with K

DROP TABLE language;

30. Deleting table which is importing from computer

In [26]:
import psycopg2
conn=psycopg2.connect("dbname=class4 user=postgres password=788105")
cur=conn.cursor()
command="""DROP TABLE language;"""
cur.execute(command)

cur.close()
conn.commit()
conn.close()

32.

1.table: address            
pk : address_id                 
fk : city_id                    

2.table: customer               
pk : customer_id                
fk : address_id                

3.table: film           
pk : film_id            
fk : language_id 

4.table: city           
pk : city_id            
fk : country_id                     

5.table: film_actor          
pk : actor_id                     
fk : film_id

33. What is the average duration of action movies?

SELECT AVG(length) FROM film WHERE film_id IN ( SELECT film_id FROM film_category WHERE category_id=1);                         

111.6093750000000000

34. Which store has the most staff?

SELECT COUNT(*),manager_staff_id FROM store GROUP BY manager_staff_id ORDER BY COUNT(*) DESC LIMIT 1                    

count:1     manager_staff_id : 1

35. What is the rating of the films of the actor named 'Gene Willis'?

SELECT rating FROM film
WHERE film_id IN (SELECT film_id FROM film_actor WHERE actor_id=(
SELECT actor_id FROM actor WHERE first_name || ' ' ||last_name = 'Gene Willis'))                            
"R"
"PG-13"
"R"
"R"
"G"
"NC-17"
"PG"
"NC-17"
"NC-17"
"PG-13"
"G"
"R"
"R"
"PG-13"
"PG"
"PG-13"
"G"
"PG"
"NC-17"
"PG"
"R"
"G"
"PG"

36. What is the number of active customers?

SELECT COUNT(*) FROM customer 
WHERE active =1;

584

37. What movies start with the letter 'C'?

SELECT title FROM film
WHERE title like 'C%';

"Chamber Italian"
"Casualties Encino"
"Cabin Flash"
"Caddyshack Jedi"
"Calendar Gunfight"
"California Birds"
"Camelot Vacation"
"Campus Remember"
"Candidate Perdition"
"Candles Grapes"
"Canyon Stock"
"Caper Motions"
"Caribbean Liberty"
"Carol Texas"
"Carrie Bunch"
"Casablanca Super"
"Casper Dragonfly"
"Cassidy Wyoming"
"Cat Coneheads"
"Catch Amistad"
"Cause Date"
"Celebrity Horn"
"Center Dinosaur"
"Chainsaw Uptown"
"Champion Flatliners"
"Chance Resurrection"
"Clash Freddy"
"Chaplin License"
"Charade Duffel"
"Chariots Conspiracy"
"Chasing Fight"
"Cheaper Clyde"
"Chicago North"
"Chicken Hellfighters"
"Chill Luck"
"Chinatown Gladiator"
"Chisum Behavior"
"Chitty Lock"
"Chocolat Harry"
"Chocolate Duck"
"Christmas Moonshine"
"Cider Desire"
"Cincinatti Whisperer"
"Circus Youth"
"Citizen Shrek"
"Cleopatra Devil"
"Clerks Angels"
"Clockwork Paradise"
"Clones Pinocchio"
"Closer Bang"
"Club Graffiti"
"Clue Grail"
"Clueless Bucket"
"Clyde Theory"
"Coast Rainbow"
"Core Suit"
"Coldblooded Darling"
"Color Philadelphia"
"Coma Head"
"Comancheros Enemy"
"Comforts Rush"
"Command Darling"
"Commandments Express"
"Coneheads Smoochy"
"Confessions Maguire"
"Confidential Interview"
"Confused Candles"
"Congeniality Quest"
"Connecticut Tramp"
"Connection Microcosmos"
"Conquerer Nuts"
"Conspiracy Spirit"
"Contact Anonymous"
"Control Anthem"
"Conversation Downhill"
"Cowboy Doom"
"Craft Outfield"
"Cranes Reservoir"
"Crazy Home"
"Creatures Shakespeare"
"Creepers Kane"
"Crooked Frogmen"
"Crossing Divorce"
"Crossroads Casualties"
"Crow Grease"
"Crowds Telemark"
"Cruelty Unforgiven"
"Crusade Honey"
"Crystal Breaking"
"Cupboard Sinners"
"Curtain Videotape"
"Cyclone Family"

38. What are the email addresses of customers paying less than $4?

39. Show the table of staff and customers residing in Moscow? (just name/surname columns)

for customer:       

SELECT first_name, last_name FROM customer 
WHERE address_id =(SELECT address_id FROM address WHERE city_id =(SELECT city_id FROM city WHERE city= 'Moscow'));          

"Catherine"	"Campbell"


for staff:                  
SELECT first_name, last_name FROM staff 
WHERE address_id =(SELECT address_id FROM address WHERE city_id =(SELECT city_id FROM city WHERE city= 'Moscow'));

null

40. What are the 5 least rented movies?

SELECT COUNT(*),film_id, title FROM film
GROUP BY film_id
ORDER BY COUNT(*) ASC LIMIT 5;                  

1	273	"Effect Gladiator"
1	51	"Balloon Homeward"
1	951	"Voyage Legally"
1	839	"Stallion Sundance"
1	652	"Pajama Jawbreaker"

41. What are the English movies released in 2006?

SELECT * FROM film WHERE release_year=2006 and
language_id=(SELECT language_id FROM language WHERE name='English');


"I found 1000 films"